# Terraform environment at23
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
module.key_vault.data.azurerm_private_dns_zone.key_vault: Reading...
module.rbac.data.azurerm_resource_group.hub: Reading...
module.key_vault.data.azurerm_private_dns_zone.key_vault: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
module.rbac.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac.data.azurerm_resource_group.spoke: Reading...
module.key_vault.data.azurerm_client_config.current: Reading...
data.azurerm_user_assigned_identity.admin: Reading...
module.postgres_server.data.azurerm_client_config.current: Reading...
module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.postgres_server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_subnet.default: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_subnet.postgres: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.appsettings.data.azurerm_resource_group.hub: Reading...
data.azurerm_private_dns_zone.postgres: Reading...
data.azurerm_subnet.postgres: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.Network/virtualNetworks/vnetssaltinnauth001at23/subnets/Postgres]
data.azurerm_subnet.default: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001at23/subnets/Default]
data.azurerm_private_dns_zone.postgres: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]
module.appsettings.data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac.data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac.data.azurerm_storage_account.use_lease[0]: Reading...
module.key_vault.data.azurerm_resource_group.key_vault: Reading...
data.azurerm_user_assigned_identity.admin: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mipgsqladminaltinnauth001at23]
module.key_vault.data.azurerm_resource_group.key_vault: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at23]
module.rbac.data.azurerm_storage_account.use_lease[0]: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.Storage/storageAccounts/staltinnauth001at23]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at23]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault_secret.postgres_app will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_app" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at23/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001at23"
      + name                    = "db-psqlsrvaltinnauthregister001at23-register-app"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.postgres_migration will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_migration" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at23/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001at23"
      + name                    = "db-psqlsrvaltinnauthregister001at23-register-migrator"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # null_resource.bootstrap_database is tainted, so must be replaced
-/+ resource "null_resource" "bootstrap_database" {
      ~ id       = "3777067936711134851" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Postgres:AppConnectionString_at23_register"] will be created
  + resource "azurerm_app_configuration_key" "key_vault_reference" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Postgres:AppConnectionString_at23_register"
      + locked                 = false
      + type                   = "vault"
      + vault_key_reference    = (known after apply)
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Postgres:MigrationConnectionString_at23_register"] will be created
  + resource "azurerm_app_configuration_key" "key_vault_reference" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Postgres:MigrationConnectionString_at23_register"
      + locked                 = false
      + type                   = "vault"
      + vault_key_reference    = (known after apply)
    }

  # module.key_vault.azurerm_role_assignment.key_vault_administrator["grant_pgsqlrv_app_contributor"] will be created
  + resource "azurerm_role_assignment" "key_vault_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "grant_pgsqlrv_app_contributor"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at23/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001at23"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault.azurerm_role_assignment.key_vault_administrator["grant_register_app_reader"] will be created
  + resource "azurerm_role_assignment" "key_vault_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "grant_register_app_reader"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at23/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001at23"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 5 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `push` |
| Working Directory | `src/apps/Altinn.Register/infra` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/at23/altinn.register.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_at23_altinn.register.tfstate.tfplan`